OpenNuvoton/NUC472_442BSP/SampleCode/StdDriver/USBOTG_Dual_Role_UMAS/main.c
/**************************************************************************//**
 * @file     main.c
 * @version  V1.00
 * $Revision: 9 $
 * $Date: 15/12/07 9:22a $
 * @brief    This is an OTG sample code. When plug-in Micro-A cable,
 *           it will become the USB host, and can access the pen drive
 *           user plugged in. When plug-in Micro-B cable, and then
 *           plug into PC, it will become a removable disk
 *
 * @note
 * Copyright (C) 2014 Nuvoton Technology Corp. All rights reserved.
*****************************************************************************/
#include <stdio.h>
#include <string.h>
#include "NUC472_442.h"
#include "diskio.h"
#include "ff.h"
#include "usbh_core.h"
#include "usbh_umas.h"
#include "massstorage.h"

#define PLLCON_SETTING      0x4228
#define PLL_CLOCK           84000000

uint32_t PllClock         = PLL_CLOCK;



static UINT blen = 4096;
DWORD acc_size;             /* Work register for fs command */
WORD acc_files, acc_dirs;
FILINFO Finfo;
FATFS FatFs[_VOLUMES];      /* File system object for logical drive */
char Line[256];             /* Console input buffer */
#if _USE_LFN
char Lfname[512];
#endif

#ifdef __ICCARM__
#pragma data_alignment=32
BYTE Buff[4096] ;       /* Working buffer */
#else
BYTE Buff[4096] __attribute__((aligned(32)));       /* Working buffer */
#endif

void Delay(uint32_t delayCnt)
{
    while(delayCnt--)
    {
        __NOP();
        __NOP();
    }
}

void timer_init()
{
    /*
     *  Configure Timer A, clock source from XTL_12M. Prescale 120
     *  Give 1 seconds counter => 100000
     */
    CLK->CLKSEL1 &= ~CLK_CLKSEL1_TMR0SEL_Msk;   /* TIMER0 clock from HXT */
    CLK->APBCLK0 |= CLK_APBCLK0_TMR0CKEN_Msk;
    TIMER0->CTL = 0;                    /* disable timer */
    TIMER0->INTSTS = 0x3;                 /* write 1 to clear for safty */
    TIMER0->CTL = (119 << TIMER_CTL_PSC_Pos) |  // pre-scale = 120
                  (0x3 << TIMER_CTL_OPMODE_Pos) |         // continuous mode
                  TIMER_CTL_CNTEN_Msk;
}

uint32_t get_timer_value()
{
    return TIMER0->CNT;
}

uint8_t bIsBdevice=0, bIsAdevice=0;
/**
  * @brief  USB_OTG_IRQHandler, OTG interrupt handler.
  * @param  None.
  * @retval None.
  */
void USB_OTG_IRQHandler(void)
{
    __IO uint32_t reg, en;

    en = OTG->INTEN;
    reg = OTG->INTSTS;

    if (reg & en & OTG_INTSTS_IDCHGIF_Msk)
    {
        printf("id 0x%x\n", OTG->STATUS);
        if (OTG->STATUS & OTG_STATUS_IDSTS_Msk)
            bIsAdevice = 0;

        OTG->INTSTS = OTG_INTSTS_IDCHGIF_Msk;
    }

    if (reg & en & OTG_INTSTS_BVLDCHGIF_Msk)
    {
        printf("b-valid 0x%x\n", OTG->STATUS);
        if ((OTG->STATUS & OTG_STATUS_IDSTS_Msk) == 0)
            bIsBdevice = 0;
        OTG->INTSTS = OTG_INTSTS_BVLDCHGIF_Msk;
    }

    OTG->INTSTS = reg;
}




/*--------------------------------------------------------------------------*/
/* Monitor                                                                  */

/*----------------------------------------------*/
/* Get a value of the string                    */
/*----------------------------------------------*/
/*  "123 -5   0x3ff 0b1111 0377  w "
        ^                           1st call returns 123 and next ptr
           ^                        2nd call returns -5 and next ptr
                   ^                3rd call returns 1023 and next ptr
                          ^         4th call returns 15 and next ptr
                               ^    5th call returns 255 and next ptr
                                  ^ 6th call fails and returns 0
*/

int xatoi (         /* 0:Failed, 1:Successful */
    TCHAR **str,    /* Pointer to pointer to the string */
    long *res       /* Pointer to a variable to store the value */
)
{
    unsigned long val;
    unsigned char r, s = 0;
    TCHAR c;


    *res = 0;
    while ((c = **str) == ' ') (*str)++;    /* Skip leading spaces */

    if (c == '-')       /* negative? */
    {
        s = 1;
        c = *(++(*str));
    }

    if (c == '0')
    {
        c = *(++(*str));
        switch (c)
        {
        case 'x':       /* hexadecimal */
            r = 16;
            c = *(++(*str));
            break;
        case 'b':       /* binary */
            r = 2;
            c = *(++(*str));
            break;
        default:
            if (c <= ' ') return 1; /* single zero */
            if (c < '0' || c > '9') return 0;   /* invalid char */
            r = 8;      /* octal */
        }
    }
    else
    {
        if (c < '0' || c > '9') return 0;   /* EOL or invalid char */
        r = 10;         /* decimal */
    }

    val = 0;
    while (c > ' ')
    {
        if (c >= 'a') c -= 0x20;
        c -= '0';
        if (c >= 17)
        {
            c -= 7;
            if (c <= 9) return 0;   /* invalid char */
        }
        if (c >= r) return 0;       /* invalid char for current radix */
        val = val * r + c;
        c = *(++(*str));
    }
    if (s) val = 0 - val;           /* apply sign if needed */

    *res = val;
    return 1;
}


/*----------------------------------------------*/
/* Dump a block of byte array                   */

void put_dump (
    const unsigned char* buff,  /* Pointer to the byte array to be dumped */
    unsigned long addr,         /* Heading address value */
    int cnt                     /* Number of bytes to be dumped */
)
{
    int i;


    printf(_T("%08lX "), addr);

    for (i = 0; i < cnt; i++)
        printf(_T(" %02X"), buff[i]);

    putchar(' ');
    for (i = 0; i < cnt; i++)
        putchar((TCHAR)((buff[i] >= ' ' && buff[i] <= '~') ? buff[i] : '.'));

    putchar('\n');
}


/*--------------------------------------------------------------------------*/
/* Monitor                                                                  */
/*--------------------------------------------------------------------------*/

static
FRESULT scan_files (
    char* path      /* Pointer to the path name working buffer */
)
{
    DIR dirs;
    FRESULT res;
    BYTE i;
    char *fn;


    if ((res = f_opendir(&dirs, path)) == FR_OK)
    {
        i = strlen(path);
        while (((res = f_readdir(&dirs, &Finfo)) == FR_OK) && Finfo.fname[0])
        {
            if (_FS_RPATH && Finfo.fname[0] == '.') continue;
#if _USE_LFN
            fn = *Finfo.lfname ? Finfo.lfname : Finfo.fname;
#else
            fn = Finfo.fname;
#endif
            if (Finfo.fattrib & AM_DIR)
            {
                acc_dirs++;
                *(path+i) = '/';
                strcpy(path+i+1, fn);
                res = scan_files(path);
                *(path+i) = '\0';
                if (res != FR_OK) break;
            }
            else
            {
                /*              printf("%s/%s\n", path, fn); */
                acc_files++;
                acc_size += Finfo.fsize;
            }
        }
    }

    return res;
}



