OpenNuvoton/NUC472_442BSP/SampleCode/StdDriver/USBOTG_Dual_Role_UMAS/main.c
    OTG->INTSTS = 0xffff;
    NVIC_EnableIRQ(USB_OTG_IRQn);
    OTG->PHYCTL = (OTG->PHYCTL | OTG_PHYCTL_OTGPHYEN_Msk) & ~OTG_PHYCTL_IDDETEN_Msk;
    Delay(1000);

    while (1)
    {
        if (OTG->STATUS & OTG_STATUS_IDSTS_Msk)   /* B-device */
        {
            if (OTG->STATUS & OTG_STATUS_BVLD_Msk)   /* plug-in */
            {
                bIsBdevice = 1;
                printf("B-device 0x%x\n", OTG->STATUS);
                USBD_Open(&gsInfo, MSC_ClassRequest, NULL);

                /* Endpoint configuration */
                MSC_Init();

                /* Enable USBD interrupt */
                NVIC_EnableIRQ(USBD_IRQn);

                OTG->INTSTS = OTG_INTSTS_BVLDCHGIF_Msk;
                OTG->INTEN = OTG_INTEN_BVLDCHGIEN_Msk;

                /* Start transaction */
                while(1)
                {
                    if (USBD_IS_ATTACHED())
                    {
                        USBD_Start();
                        break;
                    }
                }

                while(1)
                {
                    if (g_u8MscStart)
                        MSC_ProcessCmd();

                    if (!(OTG->STATUS & OTG_STATUS_BVLD_Msk))
                    {
                        OTG->INTEN &= ~OTG_INTEN_BVLDCHGIEN_Msk;
                        printf("break-B 0x%x\n", OTG->STATUS);
                        break;
                    }
                }
            }
        }
        else     /* A-device */
        {
            bIsAdevice = 1;
            printf("A-device 0x%x\n", OTG->STATUS);
            OTG->INTSTS = OTG_INTSTS_IDCHGIF_Msk;
            OTG->INTEN = OTG_INTEN_IDCHGIEN_Msk;
            USBH_Process();
            OTG->INTEN &= ~OTG_INTEN_IDCHGIEN_Msk;
        }
    }
}


/*** (C) COPYRIGHT 2013 Nuvoton Technology Corp. ***/
